# Data Analysis and Pandas:
Pandas Introduction:

Pandas stands for 'Python Data Analysis Library'.
It is open source library.
It is Excellent tool for Data processing and Analyzing of real world data.
Pandas has two different data Stuctures:

Series Data Structure
DataFrame data Structure
Series Data Structure:
It is mainly used for to create the 1-d dimensional array with named index..
DataFrame Data Structure:
It is mainly used for to create the 2-d dimensional array in the format of rows and columns.
Pandas is mainly used for data analysis and data manipulations.

By using pandas we read the large amount of data like.., excel,csv,tabular..

How to installing and importing pandas?
IDLE prefer with pip? pip install pandas

Importing library: import pandas as pd

# Series Data Structure:
- Creating Series object using list,tuple,dicitonary and also numpy array.

- Create pandas Series from array-like object using pd.Series()

- syntax: pd.Series(list,tuple,dict,numpy_array,indexnames)

- The number of elements in the index list is always equal to the number of elements in the specified series.

In [6]:
import pandas as pd
import numpy as np

In [2]:
# Creation of Series data structure using list?
L1 = [10,20,30]
sd1 = pd.Series(L1)
print(sd1)
print(type(sd1))

0    10
1    20
2    30
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
# To change the index names..
sd1.index = ['A','B','C']
sd1

A    10
B    20
C    30
dtype: int64

In [4]:
sd2 = pd.Series([23,'python',34.5,89],index=['A','B','C','D'])
print(sd2)

A        23
B    python
C      34.5
D        89
dtype: object

In [7]:
# To create the Series using numpy array?
np1 = np.array([10,20,30])
s2 = pd.Series(np1)
s2

0    10
1    20
2    30
dtype: int32

In [8]:
# Creation of Series using Dictionary?
d1 = {'Name':'Aadyan','Rno':510,'Branch':'CSE'}
sd3 = pd.Series(d1)
print(sd3)

Name      Aadyan
Rno          510
Branch       CSE
dtype: object

In [9]:
# creation of series using tuple..
sd4 = pd.Series((10,20,30))
print(sd4)

0    10
1    20
2    30
dtype: int64

# Series Indexing:
To get the data from the series..
TO access the values from a series using index names..

In [10]:
sd2 = pd.Series([10,20,30,'apssdc',45.6,'Python'])
print(sd2)

0        10
1        20
2        30
3    apssdc
4      45.6
5    Python
dtype: object

In [11]:
# To access the value from a series..
sd2[2]

30

In [12]:
sd3

Name      Aadyan
Rno          510
Branch       CSE
dtype: object

In [13]:
sd3['Name']

'Aadyan'

In [14]:
sd2[::2] # To get the alternative rows

0      10
2      30
4    45.6
dtype: object

In [15]:
sd2[:3]

0    10
1    20
2    30
dtype: object

In [16]:
sd2[::-1]

5    Python
4      45.6
3    apssdc
2        30
1        20
0        10
dtype: object

In [17]:
sd2[0]

10

In [18]:

import pandas as pd

In [19]:
sd1 = pd.Series([10,'apssdc',45.67,30,60])
print(sd1)

0        10
1    apssdc
2     45.67
3        30
4        60
dtype: object

# Update the Series value..

In [20]:
sd1[3]=100
sd1

0        10
1    apssdc
2     45.67
3       100
4        60
dtype: object

# Replace(): - Using replace() method we can update the series value. - syntax: sd.replace(to_replace=old_value,value=new_value)

In [21]:
sd1

0        10
1    apssdc
2     45.67
3       100
4        60
dtype: object

In [22]:
sd1 = sd1.replace(to_replace='apssdc',value='python')
sd1

0        10
1    python
2     45.67
3       100
4        60
dtype: object

In [23]:
sd1=sd1.replace(45.67,100)
print(sd1)

0        10
1    python
2       100
3       100
4        60
dtype: object

In [24]:
sd1 = sd1.replace(100,'data analysis')

In [25]:
sd1

0               10
1           python
2    data analysis
3    data analysis
4               60
dtype: object

In [26]:
# To update the multiple data from a series
sd1 = sd1.replace(to_replace=[10,'data analysis',60],value=[100,'java',600])
sd1

0       100
1    python
2      java
3      java
4       600
dtype: object

# Delete the data in a series:

In [27]:
sd1

0       100
1    python
2      java
3      java
4       600
dtype: object

In [28]:
# TO delete the series data..
sd1.drop(labels=2,inplace=True)
sd1

0       100
1    python
3      java
4       600
dtype: object

In [29]:
sd1.drop(labels=[0,4],inplace=True)
sd1

1    python
3      java
dtype: object

In [30]:
sd1.drop(labels=1,inplace=True)
sd1

3    java
dtype: object

# 1. Pandas DataFrame:
DataFrame is used to store the data in the form rows and columns.
It is similar to 2-D array.
To create the DataFrame using dictionary,2-D numpy.
DataFrame are imported as .csv files,.txt,.excel...

In [31]:
import pandas as pd

In [32]:
# To create the dataframe using diciotnary..
d1 = {'Name':['mani','krishna','nethra'],
      'Rno':[510,423,560],
      'Branch':['cse','ece','eee']}
df = pd.DataFrame(d1)
df

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [33]:
# To create the DataFrame using 2-d numpy array..
import numpy as np
n1 = np.array([[1,2,3],[4,5,6]])
df2 =pd.DataFrame(n1)
df2

   0  1  2
0  1  2  3
1  4  5  6

In [34]:
df

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [35]:
# To print the DataFrame column names?
df.columns

Index(['Name', 'Rno', 'Branch'], dtype='object')

In [36]:
# To print the DataFrame row values?
df.values

array([['mani', 510, 'cse'],
       ['krishna', 423, 'ece'],
       ['nethra', 560, 'eee']], dtype=object)

In [37]:
# To print the dataframe number of rows?
print(len(df.values))

3

In [38]:
# To get the dataframe index names..
print(df.index)

RangeIndex(start=0, stop=3, step=1)

In [39]:
df

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [40]:
# To print the number of rows and columns?
df.shape

(3, 3)

# pandas indexing:
To get the data from a dataframe using row indexing and column values.

In [41]:
df

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [42]:
# To print the specific column data..
df['Name']

0       mani
1    krishna
2     nethra
Name: Name, dtype: object

In [43]:
# To print the dataframe with different columns?
df[['Name','Branch']]

      Name Branch
0     mani    cse
1  krishna    ece
2   nethra    eee

In [44]:
# To print the first five records?
df.head()

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [45]:
# To print the first two records?
df.head(2)

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece

In [46]:
df.head(1) # To get the first record

   Name  Rno Branch
0  mani  510    cse

In [47]:
# To print the last record from a dataframe?
df.tail(1)

     Name  Rno Branch
2  nethra  560    eee

In [48]:
df.tail() # To print the last five records

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [49]:
df.iloc[1,1]
# To get the specific value

423

In [50]:
df.loc[(df['Rno']==423)]

      Name  Rno Branch
1  krishna  423    ece

In [51]:
df.loc[(df["Rno"]<100) & (df["Rno"]<=500)]

Empty DataFrame
Columns: [Name, Rno, Branch]
Index: []

In [52]:
df

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [53]:
# To add the new row record?
df.loc[4]=['adyan',420,'ece']
df

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee
4    adyan  420    ece

In [54]:
df = df.append(['mythri',223,'eee'],ignore_index=True)
df

        0 Branch     Name    Rno
0     NaN    cse     mani  510.0
1     NaN    ece  krishna  423.0
2     NaN    eee   nethra  560.0
3     NaN    ece    adyan  420.0
4  mythri    NaN      NaN    NaN
5     223    NaN      NaN    NaN
6     eee    NaN      NaN    NaN

In [55]:
df.drop(0,axis=1,inplace=True)
df

  Branch     Name    Rno
0    cse     mani  510.0
1    ece  krishna  423.0
2    eee   nethra  560.0
3    ece    adyan  420.0
4    NaN      NaN    NaN
5    NaN      NaN    NaN
6    NaN      NaN    NaN

In [56]:
df.dropna()

  Branch     Name    Rno
0    cse     mani  510.0
1    ece  krishna  423.0
2    eee   nethra  560.0
3    ece    adyan  420.0

In [57]:
df.dropna(inplace=True)
df

  Branch     Name    Rno
0    cse     mani  510.0
1    ece  krishna  423.0
2    eee   nethra  560.0
3    ece    adyan  420.0

In [58]:
# To add new column to DataFrame?
df['Course']=['java','python','clanguage','Data Analysis']
df

  Branch     Name    Rno         Course
0    cse     mani  510.0           java
1    ece  krishna  423.0         python
2    eee   nethra  560.0      clanguage
3    ece    adyan  420.0  Data Analysis

In [59]:
# To update the specific value..
df.loc[1,'Course']='Django'
df

  Branch     Name    Rno         Course
0    cse     mani  510.0           java
1    ece  krishna  423.0         Django
2    eee   nethra  560.0      clanguage
3    ece    adyan  420.0  Data Analysis

In [60]:
print(df.iloc[1,1]) # integer paremeter both rows and columns
print(df.loc[1,'Name']) # row names -> integers , column values

krishna
krishna

In [61]:
# To print the only specific row record?
df.iloc[1]

Branch        ece
Name      krishna
Rno         423.0
Course     Django
Name: 1, dtype: object

In [62]:
df.loc[3]

Branch              ece
Name              adyan
Rno               420.0
Course    Data Analysis
Name: 3, dtype: object

In [63]:
df

  Branch     Name    Rno         Course
0    cse     mani  510.0           java
1    ece  krishna  423.0         Django
2    eee   nethra  560.0      clanguage
3    ece    adyan  420.0  Data Analysis

In [64]:
df.iloc[:,0]

0    cse
1    ece
2    eee
3    ece
Name: Branch, dtype: object

In [65]:
df.loc[:,'Branch']

0    cse
1    ece
2    eee
3    ece
Name: Branch, dtype: object

In [66]:
# To delete the data from a dataframe?
# using drop() method 
# here ->  axis = 0 -> It is row based working.
# axis = 1 -> It is column based working.
df

  Branch     Name    Rno         Course
0    cse     mani  510.0           java
1    ece  krishna  423.0         Django
2    eee   nethra  560.0      clanguage
3    ece    adyan  420.0  Data Analysis

In [67]:
# To delete the first row record?
df.drop(1,axis=0,inplace=True)
df

  Branch    Name    Rno         Course
0    cse    mani  510.0           java
2    eee  nethra  560.0      clanguage
3    ece   adyan  420.0  Data Analysis

In [68]:
# To delete the specific column record?
df.drop('Branch',axis=1,inplace=True)
df

     Name    Rno         Course
0    mani  510.0           java
2  nethra  560.0      clanguage
3   adyan  420.0  Data Analysis

In [69]:
df.drop((df.loc[2,'Rno']),inplace=True,axis=(0,1))
df

ValueError: No axis named (0, 1) for object type DataFrame

In [70]:
# To rename the particular single column name?
df

     Name    Rno         Course
0    mani  510.0           java
2  nethra  560.0      clanguage
3   adyan  420.0  Data Analysis

In [71]:
# To rename the single column name?
df.rename(columns={'Rno':'Roll number'},inplace=True)
df

     Name  Roll number         Course
0    mani        510.0           java
2  nethra        560.0      clanguage
3   adyan        420.0  Data Analysis